# IsItemEnabled

## Description
Determines if the specified item is currently enabled.

```pascal
FUNCTION IsItemEnabled(
				nDialogID    : LONGINT;
				nComponentID : LONGINT): BOOLEAN;
```

```python
def vs.IsItemEnabled(nDialogID, nComponentID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern